app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `property`
SELECT COUNT(*) AS `numrows`
FROM `p_tenant`
SELECT COUNT(*) AS `numrows`
FROM `unit`
SELECT COUNT(*) AS `numrows`
FROM `unit`
WHERE `vacant_status` = 0
---
    public function index()
    {
        $propertyModel    = new PropertyModel();
        $tenantModel      = new TenantModel();
        $unitModel        = new UnitModel();
        $invoiceModel     = new InvoiceModel();
        $maintenanceModel = new MaintenanceModel();
        $appModel         = new ApplicationInfoModel();

        $data = [
            'title'             => 'Dashboard',
            'total_properties'  => $propertyModel->countAllResults(),
            'total_tenants'     => $tenantModel->countAllResults(),
            'total_units'       => $unitModel->countAllResults(),
            'vacant_units'      => $unitModel->where('vacant_status', 1)->countAllResults(),