app/Controllers/Admin/Landlord.php

SELECT *
FROM `p_landlord`
---
    public function index()
    {
        $data = [
            'title'     => 'Manage Landlords',
            'landlords' => $this->landlordModel->findAll()