app/Controllers/Admin/Lease.php

    public function index()
    {
        $data = [
            'title'  => 'Lease Agreements',
            'leases' => $this->leaseModel
                        ->select('p_lease.*, p_tenant.tenant_name, property.property_name, unit.unit_name')
                        ->join('p_tenant', 'p_tenant.tenant_id = p_lease.tenantId', 'left')
                        ->join('property', 'property.property_id = p_lease.property_name', 'left')
                        ->join('unit', 'unit.unit_id = p_lease.vacant_unit', 'left')
                        ->findAll()
---
SELECT `p_lease`.*, `p_tenant`.`tenant_name`, `property`.`property_name`, `unit`.`unit_name`
FROM `p_lease`
LEFT JOIN `p_tenant` ON `p_tenant`.`tenant_id` = `p_lease`.`tenantId`
LEFT JOIN `property` ON `property`.`property_id` = `p_lease`.`property_name`
LEFT JOIN `unit` ON `unit`.`unit_id` = `p_lease`.`vacant_unit`