app/Controllers/Admin/Property.php

SELECT *
FROM `property`
---
    public function index()
    {
        $data = [
            'title'      => 'Manage Properties',
            'properties' => $this->propertyModel->findAll()