app/Models/InvoiceModel.php

SELECT `p_tenant_bill`.*, `p_tenant`.`tenant_name`, `property`.`property_name`
FROM `p_tenant_bill`
LEFT JOIN `p_tenant` ON `p_tenant`.`tenant_id` = `p_tenant_bill`.`TenantId`
LEFT JOIN `property` ON `property`.`property_id` = `p_tenant_bill`.`PropertyId`
---
    public function getInvoicesWithDetails()
    {
        return $this->select('p_tenant_bill.*, p_tenant.tenant_name, property.property_name')
                    ->join('p_tenant', 'p_tenant.tenant_id = p_tenant_bill.TenantId', 'left')
                    ->join('property', 'property.property_id = p_tenant_bill.PropertyId', 'left')
                    ->findAll();