app/Models/TenantModel.php

SELECT `p_tenant`.*, `property`.`property_name` as `prop_name`, `unit`.`unit_name`
FROM `p_tenant`
LEFT JOIN `property` ON `property`.`property_id` = `p_tenant`.`property_name`
LEFT JOIN `unit` ON `unit`.`unit_id` = `p_tenant`.`vacant_unit`
---
    public function getTenantsWithDetails()
    {
        return $this->select('p_tenant.*, property.property_name as prop_name, unit.unit_name')
                    ->join('property', 'property.property_id = p_tenant.property_name', 'left')
                    ->join('unit', 'unit.unit_id = p_tenant.vacant_unit', 'left')
                    ->findAll();