app/Models/UnitModel.php

    public function getUnitsWithProperty()
    {
        return $this->select('unit.*, property.property_name as prop_name')
                    ->join('property', 'property.property_id = unit.property_name', 'left')
                    ->findAll();
---
SELECT `unit`.*, `property`.`property_name` as `prop_name`
FROM `unit`
LEFT JOIN `property` ON `property`.`property_id` = `unit`.`property_name`